{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence listing WhatsApp form‑submission requirements and associated frontend files.",
  "frontend-file-summaries.txt": "Text file containing auto‑generated one‑sentence summaries for all frontend source files.",
  "frontend/index.css": "Tailwind base styles and CSS variables defining light/dark theme colors and global element styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React component handling navigation between questionnaire, completion, and contact views with header and footer.",
  "frontend/src/components/AxisMaxLifeHeader.tsx": "Sticky header with logo navigation and a Contact Us button highlighting when active.",
  "frontend/src/components/CompletionScreen.tsx": "Displays completion stats, results summary, and navigation to contact or restart.",
  "frontend/src/components/ContactUsPage.tsx": "Contact form collecting user details and triggering WhatsApp URL creation with fallback UI if auto‑open fails.",
  "frontend/src/components/HeroBanner.tsx": "Renders a styled hero banner with title, subtitle, optional description, and decorative animations.",
  "frontend/src/components/QuestionnaireFlow.tsx": "Controls questionnaire progression, tracks answers, shows progress UI, and triggers a popup when 60% yes answers are reached.",
  "frontend/src/components/ResultsSummary.tsx": "Displays a summary of all questions with yes/no indicators in both English and Hindi.",
  "frontend/src/components/YesSixtyPopup.tsx": "Shows a congratulatory dialog when the user reaches the 60% yes threshold, prompting them to continue.",
  "frontend/src/content/questions.axisMaxLife.ts": "Defines and exports the full list of English and Hindi questionnaire questions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity state management using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing since no backend queries are required.",
  "frontend/src/hooks/useQuestionnaireSession.ts": "Manages questionnaire answers and popup state with localStorage persistence and reset capability.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for theming, including light/dark mode palettes and animation utilities.",
  "frontend/src/lib/whatsapp.ts": "Provides helpers to build a wa.me URL with pre-filled contact data and open it in a new browser tab.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Extends Tailwind with custom colors, typography, animations, shadows, and OKLCH-driven theme variables.",
  "project_state.json": "Tracks project requirements and issues, focusing on fixing the contact form to open WhatsApp with pre-filled user details."
}